{"posts":[{"title":"Windows App. Programming Note","text":"Week 1:Ch1:Visual Basic Versus VBA: It is a programming language and development enviroment created by Microsoft Basic programming language with some basic function Provides a graphical user interface GUI. Part of Microsoft built to help write programs for the Windows operating system Internal Programming language: Excel PowerPoint Word Outlook Publisher Visio Visual Basic(VB) Versus VBA VB VBA A development Language that you can buy and run separately Uses the VB programming language as a backbone NO NEED FOR EXCEL Uses the VB programming language as a backboneTH OFFICE Basic TerminologySubroutine, procedure, a macro: logically related lines of code that accomplishes a specific task Programmers use Subroutine and Procedure Spreadsheet users use macro Program: Refers to all the subs in an application Sub: Perform one specific task in the overall program CH2:(The excel Object Model)Objects: Cars, houses, computers… Attributes of a car(Properties): weight, horsepower, color, number of doors… Property has a Value: white, four doors… Methods(the things that you can do with an object): drive, park, accelerate… Arguments: speed Excel Object Model Parts of Speech Parts of Car EG Objects Nouns Car Properties Adjectives Red Methods Verbs Drive Arguments Adverb Speed Excel Objects: Ranges Single-cell range C8: Range objects Properties: Value: number HorizontalAlignment: right-aligned Formula: =SUM(C1:C6) Methods Copy-Argument: Destination Clear(no argument) ClearContents(no argument) Events Click || Double-click a bubtton Press key Hover your mouse An event Fires Event handler is a section of code that runs associated event fires Collections as Objeccts Methods and properties: Count Property Add method Collections as Objects, cont. Collection objects are plural Object contained in a collection is singular EG: Worksheets collection is the collection of all worksheets in the workbook Property: count associated worksheets Method: add another worksheet to the collection Worksheet: –&gt; individual objects: Property: Name **Method: ** Delete Collections VS Individual Objects: The only exception to the plural/singular trait is the Range object Theres no “Range” collection object “Range” object cannot be considered singular or plural The Hierarchy of Objects: Collection object contains a set of individual objects(cars), with their own properties and methods Each object as well contains a number of objects: Wheels Trunks Hood CH3: Visual Basic Editor(VBE) Programming workspace Integrated Developmet Environment(IDE) VBE is the IDE for programming with VBA in Excel","link":"/2024/01/14/Windows%20App.%20Programming%20Note/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/01/08/hello-world/"}],"tags":[{"name":"Learning note","slug":"Learning-note","link":"/tags/Learning-note/"}],"categories":[],"pages":[]}